자료형 -> category : 성별, Embarked(탑승 지역명)
연속적인 데이터들 중(int64 중) category : Pclass, Survived

결측치 처리

연령대별, 성별별, 티켓등급별 살아남은 인원수 분석

In [1]:
import pandas as pd

titanic=pd.read_csv('../Data/titanic.csv')
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [2]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

## 결측치 처리 ----------------------------------------------------------------------------------

### Embarked(선착장) 결측치

In [3]:
titanic.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [4]:
# 각 선착장별 탑승객 수
titanic.groupby(['Embarked'])['Embarked'].count()

Embarked
C    168
Q     77
S    644
Name: Embarked, dtype: int64

In [5]:
# S 선착장에서 탄 사람이 가장 많으므로 Embarked 열의 결측치를 S로 채움
titanic['Embarked'].fillna('S', inplace=True)

### Cabin 결측치

In [6]:
titanic.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
dtype: int64

In [7]:
titanic.shape

(891, 12)

In [8]:
# Cabin의 결측치 수가 전체 데이터 수(891)에 비해 너무 많으므로 열 삭제
titanic.drop(columns=['Cabin'], inplace=True)

In [9]:
titanic.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Embarked'],
      dtype='object')

### Age 결측치

In [10]:
titanic['Age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [11]:
# Age의 결측치는.... 평균으로 채우기
titanic['Age'].fillna(int(titanic['Age'].mean()), inplace=True)

In [12]:
titanic.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

#### Age에 소수점 값이 들어가있음 => int로 변환

In [13]:
titanic['Age']=titanic['Age'].astype('int')

In [14]:
titanic['Age']

0      22
1      38
2      26
3      35
4      35
       ..
886    27
887    19
888    29
889    26
890    32
Name: Age, Length: 891, dtype: int32

## 자료형변환 ----------------------------------------------------------------------------------------

In [15]:
# object를 category로
titanic[['Sex', 'Embarked']]=titanic[['Sex', 'Embarked']].astype('category')

In [16]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    category
 5   Age          891 non-null    int32
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Embarked     891 non-null    category
dtypes: category(2), float64(1), int32(1), int64(5), object(2)
memory usage: 61.3+ KB

In [17]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,S

In [18]:
# int, float를 category로
titanic[['Survived', 'Pclass']]=titanic[['Survived', 'Pclass']].astype('category')

In [19]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    category
 2   Pclass       891 non-null    category
 3   Name         891 non-null    object
 4   Sex          891 non-null    category
 5   Age          891 non-null    int32
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Embarked     891 non-null    category
dtypes: category(4), float64(1), int32(1), int64(3), object(2)
memory usage: 49.4+ KB

## 연령대 컬럼 추가 --------------------------------------------------------------------

In [20]:
# 나이의 최소값, 최대값
titanic['Age'].min(), titanic['Age'].max()

(0, 80)

In [21]:
# 나이가 20살 미만인 사람들
titanic[titanic['Age']<20]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2,3,1,349909,21.0750,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14,1,0,237736,30.0708,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4,1,1,PP 9549,16.7000,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14,0,0,350406,7.8542,S
16,17,0,3,"Rice, Master. Eugene",male,2,4,1,382652,29.1250,Q
...,...,...,...,...,...,...,...,...,...,...,...
855,856,1,3,"Aks, Mrs. Sam (Leah Rosen)",female,18,0,1,392091,9.3500,S
869,870,1,3,"Johnson, Master. Harold Theodor",male,4,1,1,347742,11.1333,S
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15,0,0,2667,7.2250,C
877,878,0,3,"Petroff, Mr. Nedelio",male,19,0,0,349212,7.8958,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19,0,0,112053,30.0000,S

In [22]:
cond1=(titanic['Age']<20)
cond2=(titanic['Age']>=20)&(titanic['Age']<30)
cond3=(titanic['Age']>=30)&(titanic['Age']<40)
cond4=(titanic['Age']>=40)&(titanic['Age']<50)
cond5=(titanic['Age']>=50)&(titanic['Age']<60)
cond6=(titanic['Age']>=60)&(titanic['Age']<70)
cond7=(titanic['Age']>=70)&(titanic['Age']<=80)

In [23]:
titanic.loc[cond1, 'Age_group']='0 to 19'
titanic.loc[cond2, 'Age_group']='20s'
titanic.loc[cond3, 'Age_group']='30s'
titanic.loc[cond4, 'Age_group']='40s'
titanic.loc[cond5, 'Age_group']='50s'
titanic.loc[cond6, 'Age_group']='60s'
titanic.loc[cond7, 'Age_group']='70s'

In [24]:
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Age_group
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,S,20s
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C,30s
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,S,20s
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,S,30s
4,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,S,30s
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27,0,0,211536,13.0000,S,20s
887,888,1,1,"Graham, Miss. Margaret Edith",female,19,0,0,112053,30.0000,S,0 to 19
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29,1,2,W./C. 6607,23.4500,S,20s
889,890,1,1,"Behr, Mr. Karl Howell",male,26,0,0,111369,30.0000,C,20s
890,891,0,3,"Dooley, Mr. Patrick",male,32,0,0,370376,7.7500,Q,30s

## 연령대별 살아남은 인원수

In [25]:
age_group_surv=titanic.groupby(['Age_group', 'Survived'])['Survived'].count()
age_group_surv

Age_group  Survived
0 to 19    0            85
           1            79
20s        0           268
           1           129
30s        0            94
           1            73
40s        0            55
           1            34
50s        0            28
           1            20
60s        0            13
           1             6
70s        0             6
           1             1
Name: Survived, dtype: int64

In [26]:
age_group_people=titanic.groupby(['Age_group'])['PassengerId'].count()
age_group_people

Age_group
0 to 19    164
20s        397
30s        167
40s         89
50s         48
60s         19
70s          7
Name: PassengerId, dtype: int64

In [27]:
# 연령대별 살아남은 인원수 비율
age_group_surv/age_group_people

Age_group  Survived
0 to 19    0           0.518293
           1           0.481707
20s        0           0.675063
           1           0.324937
30s        0           0.562874
           1           0.437126
40s        0           0.617978
           1           0.382022
50s        0           0.583333
           1           0.416667
60s        0           0.684211
           1           0.315789
70s        0           0.857143
           1           0.142857
dtype: float64

In [28]:
# 총 사람수 대비 살아남은 인원수 비율
age_group_surv/titanic['Age_group'].count()

Age_group  Survived
0 to 19    0           0.095398
           1           0.088664
20s        0           0.300786
           1           0.144781
30s        0           0.105499
           1           0.081930
40s        0           0.061728
           1           0.038159
50s        0           0.031425
           1           0.022447
60s        0           0.014590
           1           0.006734
70s        0           0.006734
           1           0.001122
Name: Survived, dtype: float64

In [29]:
titanic['Age_group'].count()

891

## 성별별 살아남은 인원수

In [30]:
sex_surv=titanic.groupby(['Sex', 'Survived'])['Survived'].count()
sex_surv

Sex     Survived
female  0            81
        1           233
male    0           468
        1           109
Name: Survived, dtype: int64

In [31]:
sex_people=titanic.groupby(['Sex'])['Survived'].count()
sex_people

Sex
female    314
male      577
Name: Survived, dtype: int64

In [32]:
# 성별별 살아남은 인원수 비율
sex_surv/sex_people

Sex     Survived
female  0           0.257962
        1           0.742038
male    0           0.811092
        1           0.188908
Name: Survived, dtype: float64

In [33]:
# 총 인원수 대비 살아남은 사람 비율
sex_surv/titanic['Sex'].count()

Sex     Survived
female  0           0.090909
        1           0.261504
male    0           0.525253
        1           0.122334
Name: Survived, dtype: float64

## 티켓 등급별 살아남은 인원수

In [34]:
pclass_surv=titanic.groupby(['Pclass', 'Survived'])['Survived'].count()
pclass_surv

Pclass  Survived
1       0            80
        1           136
2       0            97
        1            87
3       0           372
        1           119
Name: Survived, dtype: int64

In [35]:
pclass_people=titanic.groupby(['Pclass'])['Survived'].count()
pclass_people

Pclass
1    216
2    184
3    491
Name: Survived, dtype: int64

In [36]:
# pclass별 살아남은 수 비율
pclass_surv/pclass_people

Pclass  Survived
1       0           0.370370
        1           0.629630
2       0           0.527174
        1           0.472826
3       0           0.757637
        1           0.242363
Name: Survived, dtype: float64

In [37]:
pclass_surv/titanic['Pclass'].count()

Pclass  Survived
1       0           0.089787
        1           0.152637
2       0           0.108866
        1           0.097643
3       0           0.417508
        1           0.133558
Name: Survived, dtype: float64